Revit 2027 API
SpatialElementBoundarySubface.GetBoundingElementFace Method
 Returns the face of the bounding element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public Face GetBoundingElementFace()
Public Function GetBoundingElementFace As Face
public:
Face^ GetBoundingElementFace()
member GetBoundingElementFace : unit -> Face
Return Value
Face
 The face of the bounding element.
Remarks
 Applies only if the options chosen for the extraction of the element's geometry is Finish. Faces do not contain voids in room-bounding elements (such the voids in walls created by doors and windows).
See Also
Reference
SpatialElementBoundarySubface Class
Autodesk.Revit.DB Namespace